In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Transactions

In [3]:
dataset= pd.read_excel('D:\\KPMG_VI_New_raw_data_update_final.xlsx',sheet_name='Transactions')

In [4]:
dataset.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,2012-12-02
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,2014-03-03
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,1999-07-20
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,1998-12-16
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,2015-08-10

In [50]:
dataset.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [6]:
dataset.describe()

,transaction_id,product_id,customer_id,online_order,list_price,standard_cost
count,20000.000000,20000.00000,20000.000000,19640.000000,20000.000000,19803.000000
mean,10000.500000,45.36465,1738.246050,0.500458,1107.829449,556.046951
std,5773.647028,30.75359,1011.951046,0.500013,582.825242,405.955660
min,1.000000,0.00000,1.000000,0.000000,12.010000,7.210000
25%,5000.750000,18.00000,857.750000,0.000000,575.270000,215.140000
50%,10000.500000,44.00000,1736.000000,1.000000,1163.890000,507.580000
75%,15000.250000,72.00000,2613.000000,1.000000,1635.300000,795.100000
max,20000.000000,100.00000,5034.000000,1.000000,2091.470000,1759.850000

In [51]:
from statistics import mode

In [52]:
online_order = dataset[dataset['online_order']!=np.nan]['online_order']
dataset['online_order']= dataset['online_order'].replace(np.nan,mode(online_order))

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order                 0
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [53]:
brand = dataset[dataset['brand']!=np.nan]['brand']
dataset['brand']=dataset['brand'].replace(np.nan,mode(brand))
dataset.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order                 0
order_status                 0
brand                        0
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [54]:
product_line = dataset[dataset['product_line']!=np.nan]['product_line']
dataset['product_line']=dataset['product_line'].replace(np.nan,mode(product_line))
dataset.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order                 0
order_status                 0
brand                        0
product_line                 0
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [55]:
product_class = dataset[dataset['product_class']!=np.nan]['product_class']
dataset['product_class']=dataset['product_class'].replace(np.nan,mode(product_class))
dataset.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order                 0
order_status                 0
brand                        0
product_line                 0
product_class                0
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [56]:
product_size = dataset[dataset['product_size']!=np.nan]['product_size']
dataset['product_size']=dataset['product_size'].replace(np.nan,mode(product_size))
dataset.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order                 0
order_status                 0
brand                        0
product_line                 0
product_class                0
product_size                 0
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [58]:
standard_cost = dataset[dataset['standard_cost']!=np.nan]['standard_cost']
dataset['standard_cost']=dataset['standard_cost'].replace(np.nan,standard_cost.mean())
dataset.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order                 0
order_status                 0
brand                        0
product_line                 0
product_class                0
product_size                 0
list_price                   0
standard_cost                0
product_first_sold_date    197
dtype: int64

In [59]:
product_first_sold_date = dataset[dataset['product_first_sold_date']!=np.nan]['product_first_sold_date']
dataset['product_first_sold_date']=dataset['product_first_sold_date'].replace(np.nan,mode(product_first_sold_date))
dataset.isnull().sum()

transaction_id             0
product_id                 0
customer_id                0
transaction_date           0
online_order               0
order_status               0
brand                      0
product_line               0
product_class              0
product_size               0
list_price                 0
standard_cost              0
product_first_sold_date    0
dtype: int64

In [64]:
dataset

AttributeError: 'Series' object has no attribute 'date'

In [65]:
dataset['online_order'].value_counts()

1.0    10189
0.0     9811
Name: online_order, dtype: int64

In [83]:
dataset.isnull().sum()

transaction_id             0
product_id                 0
customer_id                0
transaction_date           0
online_order               0
order_status               0
brand                      0
product_line               0
product_class              0
product_size               0
list_price                 0
standard_cost              0
product_first_sold_date    0
dtype: int64

# Customer Demographics

In [114]:
dataset_CD= pd.read_excel('D:\\KPMG_VI_New_raw_data_update_final.xlsx',sheet_name='CustomerDemographic')

In [115]:
dataset_CD.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,Age
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0,66.697616
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0,39.500356
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0,66.423644
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,No,7.0,58.716794
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,8.0,43.097616

In [116]:
dataset_CD.describe()

,customer_id,past_3_years_bike_related_purchases,tenure,Age
count,4000.000000,4000.000000,3913.000000,3999.000000
mean,2000.500000,48.890000,10.657041,44.585003
std,1154.844867,28.715005,5.660146,16.858414
min,1.000000,0.000000,1.000000,18.253781
25%,1000.750000,24.000000,6.000000,33.641452
50%,2000.500000,48.000000,11.000000,43.133233
75%,3000.250000,73.000000,15.000000,53.326383
max,4000.000000,99.000000,22.000000,120.516794

In [117]:
dataset_CD.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                  87
Age                                      1
dtype: int64

In [118]:
dataset_CD.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 13 columns):
customer_id                            4000 non-null int64
first_name                             4000 non-null object
last_name                              3875 non-null object
gender                                 4000 non-null object
past_3_years_bike_related_purchases    4000 non-null int64
DOB                                    3913 non-null datetime64[ns]
job_title                              3494 non-null object
job_industry_category                  3344 non-null object
wealth_segment                         4000 non-null object
deceased_indicator                     4000 non-null object
owns_car                               4000 non-null object
tenure                                 3913 non-null float64
Age                                    3999 non-null float64
dtypes: datetime64[ns](1), float64(2), int64(2), object(8)
memory usage: 406.3+ KB

In [119]:
job_title = dataset_CD[dataset_CD['job_title']!=np.nan]['job_title']
dataset_CD['job_title']=dataset_CD['job_title'].replace(np.nan,'Not_mentioned')
dataset_CD.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                                0
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                  87
Age                                      1
dtype: int64

In [120]:
job_industry_category = dataset_CD[dataset_CD['job_industry_category']!=np.nan]['job_industry_category']
dataset_CD['job_industry_category']=dataset_CD['job_industry_category'].replace(np.nan,'Not_mentioned')
dataset_CD.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                                0
job_industry_category                    0
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                  87
Age                                      1
dtype: int64

In [121]:
tenure = dataset_CD[dataset_CD['tenure']!=np.nan]['tenure']
dataset_CD['tenure']=dataset_CD['tenure'].replace(np.nan,'Not_mentioned')
dataset_CD.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                                0
job_industry_category                    0
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
Age                                      1
dtype: int64

In [122]:
dataset_CD['tenure'].unique()

array([11.0, 16.0, 15.0, 7.0, 8.0, 13.0, 20.0, 9.0, 6.0, 1.0, 18.0, 21.0,
       12.0, 19.0, 14.0, 4.0, 22.0, 5.0, 17.0, 2.0, 3.0, 10.0,
       'Not_mentioned'], dtype=object)

In [123]:
dataset_CD = dataset_CD.dropna(how='any',subset=['DOB'])
dataset_CD.isnull().sum()

customer_id                              0
first_name                               0
last_name                              121
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                      0
job_title                                0
job_industry_category                    0
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
Age                                      1
dtype: int64

In [124]:
Age = dataset_CD[dataset_CD['Age']!=np.nan]['Age']
dataset_CD.iloc[:,12]=dataset_CD.iloc[:,12].replace(np.nan,Age.mean())
dataset_CD.isnull().sum()

customer_id                              0
first_name                               0
last_name                              121
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                      0
job_title                                0
job_industry_category                    0
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
Age                                      0
dtype: int64

In [125]:
dataset_CD['Age'].unique()

array([66.69761629, 39.50035601, 66.42364368, ..., 44.51679437,
       18.91405464, 28.60720533])

In [131]:
sum(dataset_CD['Age']>80)

2

In [132]:
dataset_CD.isnull().sum()

customer_id                              0
first_name                               0
last_name                              121
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                      0
job_title                                0
job_industry_category                    0
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
Age                                      0
dtype: int64

# Customer Address

In [133]:
dataset_CA= pd.read_excel('D:\\KPMG_VI_New_raw_data_update_final.xlsx',sheet_name='CustomerAddress')

In [134]:
dataset_CA.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,NSW,Australia,10
1,2,6 Meadow Vale Court,2153,NSW,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,NSW,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [135]:
dataset_CA.isnull().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [140]:
dataset_NC= pd.read_excel('D:\\KPMG_VI_New_raw_data_update_final.xlsx',sheet_name='NewCustomerList')

In [141]:
dataset_NC.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,...,QLD,Australia,6,0.45,0.5625,0.703125,0.597656,1,1,1.718750
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,...,NSW,Australia,11,0.49,0.4900,0.612500,0.520625,1,1,1.718750
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,...,VIC,Australia,5,0.61,0.6100,0.610000,0.610000,1,1,1.718750
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,...,QLD,Australia,1,0.50,0.6250,0.625000,0.625000,4,4,1.703125
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,...,NSW,Australia,9,0.45,0.4500,0.562500,0.562500,4,4,1.703125

In [142]:
dataset_NC.isnull().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Unnamed: 16                              0
Unnamed: 17                              0
Unnamed: 18                              0
Unnamed: 19                              0
Unnamed: 20                              0
Rank                                     0
Value                                    0
dtype: int64

In [143]:
with pd.ExcelWriter('D:/KPMG_module1.xlsx',engine='xlsxwriter') as writer:
    dataset.to_excel(writer,sheet_name="Transaction")
    dataset_CA.to_excel(writer,sheet_name='CustomerAddress')
    dataset_CD.to_excel(writer,sheet_name='CustomerDemographic')
    dataset_NC.to_excel(writer,sheet_name='NewCustomerList')